Autodesk.Revit.DB.ModelPathUtils.CloudRegionEMEA
The name of cloud region EMEA.
This method is deprecated in Revit 2026.3 and may be removed in a later version of Revit.
See GetAllCloudRegions to get the list of all available regions.
Since:
2021

Autodesk.Revit.DB.ModelPathUtils.CloudRegionUS
The name of cloud region US.
This method is deprecated in Revit 2026.3 and may be removed in a later version of Revit.
See GetAllCloudRegions to get the list of all available regions.
Since:
2021

Autodesk.Revit.DB.ModelPathUtils.ConvertCloudGUIDsToCloudPath(System.String,System.Guid,System.Guid)
Converts a pair of cloud project and model GUIDs to a valid cloud path.
region:
The region of cloud model.
Please see the reference values, like Autodesk.Revit.DB.ModelPathUtils.CloudRegionUS and Autodesk.Revit.DB.ModelPathUtils.CloudRegionEMEA,
and the new regions from release note.
projectGuid:
The GUID of the cloud project which contains the model.
modelGuid:
The GUID of the Revit cloud model.
Returns:
The cloud model path.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.CentralModelException:
The cloud project is missing.
Throws Autodesk.Revit.Exceptions.RevitServerCommunicationException:
The central server could not be reached.
Throws Autodesk.Revit.Exceptions.RevitServerUnauthenticatedUserException:
You must sign in to complete action.
Throws Autodesk.Revit.Exceptions.RevitServerUnauthorizedException:
You are unauthorized to access this resource.
Since:
2021

Autodesk.Revit.DB.ModelPathUtils.GetAllCloudRegions
Gets all available regions that are supported by the cloud service. It returns an empty list when something gets wrong. Check the journal to see the error message for further information.
Remarks:
The list may change dynamically when Revit Cloud Model are declared to support more regions.
Returns:
The list of regions.
Since:
2026.3